;***************************************
;新能力描述
;***************************************

[RustyPanacea X2AbilityTemplate]  
LocFriendlyName="万能治愈"  
LocLongDescription="使用念动力治愈盟友的心灵。"  
LocHelpText="使用念动力治愈盟友的心灵。"  
LocFlyOverText="万能治愈"  
LocPromotionPopupText="<Bullet/>使用念动力治愈盟友的身体和心灵。移除大多数精神和环境效果。<br/><Bullet/>赋予目标<Ability:PANACEA_APGRANTED/>标准行动。<br/><Bullet/>消耗<Ability:PANACEA_COST_AP/>行动点数。<br/><Bullet/>有<Ability:PANACEA_COST_COOLDOWN/>回合冷却时间。<br/><Bullet/>是一个免费行动：<Ability:PANACEA_COST_FREE/>。<br/><Bullet/>在回合结束时：<Ability:PANACEA_COST_TURNENDING/>"  
  
[RustyPsiHeal X2AbilityTemplate]  
LocFriendlyName="灵魂修复"  
LocLongDescription="使用念动力治愈盟友的身体。"  
LocHelpText="使用念动力治愈盟友的身体。"  
LocFlyOverText="灵魂修复"  
LocPromotionPopupText="<Bullet/>使用念动力治愈盟友的身体。作用类似于医疗包，但来自<Ability:ClassName/>的心灵。<br/><Bullet/>消耗<Ability:PSIHEAL_COST_AP/>行动点数。<br/><Bullet/>有<Ability:PSIHEAL_COST_COOLDOWN/>回合冷却时间。<br/><Bullet/>是一个免费行动：<Ability:PSIHEAL_COST_FREE/>。<br/><Bullet/>在回合结束时：<Ability:PSIHEAL_COST_TURNENDING/>"  
  
[RustySixthSense X2AbilityTemplate]  
LocFriendlyName="第六感"  
LocLongDescription="能够预测攻击。在被揭露后获得<Ability:SSDODGE/>次闪避，持续<Ability:SSTURN/>回合。"  
LocHelpText="在被揭露后获得<Ability:SSDODGE/>次闪避，持续<Ability:SSTURN/>回合。"  
LocFlyOverText="第六感"  
  
[SixthSense_Passive X2AbilityTemplate]  
LocFriendlyName="第六感"  
LocLongDescription="能够预测攻击。在被揭露后获得<Ability:SSDODGE/>次闪避，持续<Ability:SSTURN/>回合。可以在任务中重新隐蔽。"  
LocHelpText="在被揭露后获得<Ability:SSDODGE/>次闪避，持续<Ability:SSTURN/>回合。可以在任务中重新隐蔽。"  
LocFlyOverText="第六感"  
  
[SixthSense_Stealth X2AbilityTemplate]  
LocFriendlyName="第六感暗影"  
LocLongDescription="立即进入隐蔽状态。"  
LocHelpText="立即进入隐蔽状态。"  
LocFlyOverText="第六感暗影"  
LocPromotionPopupText="<Bullet/>可以在任何位置进入隐蔽状态，但如果在附近敌人的探测范围内进行，<Ability:ClassName/>在被包围时会暴露。<br/>"  
  
;***************************************  
;GTS - 4级时默认解锁
;***************************************  
  
[Rusty_SixthSenseUnlock X2SoldierAbilityUnlockTemplate]  
DisplayName="念动力：第六感"  
Summary="在打破隐蔽后获得闪避。在任何任务中还可以获得一次重新隐蔽的机会。"  
  
;****************************************************  
;	灵能职业定位
;************************************************  
  
;*** 百科全书条目 ***  
[RustyPsionic X2EncyclopediaTemplate]  
ListTitle = "念动力特工"  
DescriptionTitle = "念动力特工"  
DescriptionEntry = "XCOM的一个神秘新分支，念动力特工利用他们的精神能力极大地增强了盟友并削弱了敌人的意志。"  
  
[RustyPsionic X2SoldierClassTemplate]  
DisplayName="念动力"  
ClassSummary="XCOM的一个神秘新分支，念动力特工利用他们的精神能力极大地增强了盟友并削弱了敌人的意志。"  
  
;老式树风格 
LeftAbilityTreeTitle="心灵感应者"  
RightAbilityTreeTitle="共鸣者"  
  
;npsbd树风格  
AbilityTreeTitles[0]="心灵感应者"  
AbilityTreeTitles[1]="共鸣者"  
AbilityTreeTitles[2]="铱星人"  
AbilityTreeTitles[3]="XCOM"

;按字母顺序排列的昵称，否则它们不起作用！
RandomNickNames[0]="乌鸦"  
RandomNickNames[1]="恶魔"  
RandomNickNames[2]="挽歌"  
RandomNickNames[3]="恐惧"  
RandomNickNames[4]="德鲁伊"  
RandomNickNames[5]="黄昏"  
RandomNickNames[6]="回声"  
RandomNickNames[7]="幽灵"  
RandomNickNames[8]="萤火虫"  
RandomNickNames[9]="怪人"  
RandomNickNames[10]="食尸鬼"  
RandomNickNames[11]="冷酷的"  
RandomNickNames[12]="薄雾"  
RandomNickNames[13]="恶魔般的人"  
RandomNickNames[14]="厄运"  
RandomNickNames[15]="法官"  
RandomNickNames[16]="午夜"  
RandomNickNames[17]="噩梦"  
RandomNickNames[18]="空值"  
RandomNickNames[19]="通灵板"  
RandomNickNames[20]="欧米伽"  
RandomNickNames[21]="预兆"  
RandomNickNames[22]="奥兹"  
RandomNickNames[23]="凤凰"  
RandomNickNames[24]="先知"  
RandomNickNames[25]="精神病患者"  
RandomNickNames[26]="乌鸦"  
RandomNickNames[27]="稻草人"  
RandomNickNames[28]="尖叫"  
RandomNickNames[29]="幽灵"  
RandomNickNames[30]="综合征"  
RandomNickNames[31]="惊悚片"  
RandomNickNames[32]="抽搐"  
RandomNickNames[33]="维达"  
RandomNickNames[34]="吸血鬼"  
RandomNickNames[35]="毒蛇"  
RandomNickNames[36]="巫毒"  
RandomNickNames[37]="男巫"  
RandomNickNames[38]="狼人"  
RandomNickNames[39]="女巫般的"  
RandomNickNames[40]="巫师"  
RandomNickNames[41]="异星生物"  
RandomNickNames[42]="禅"  
RandomNickNames[43]="零"  
RandomNickNames[44]="僵尸"  
  
RandomNickNames_Male[0]="洛基"  
RandomNicknames_Male[1]="梅林"  
RandomNickNames_Male[2]="法老"  
RandomNicknames_Male[3]="传教士"  
  
RandomNicknames_Female[0]="奥罗拉"  
RandomNicknames_Female[1]="女妖"  
RandomNickNames_Female[2]="灰夫人"  
RandomNicknames_Female[3]="苦难"  
RandomNicknames_Female[4]="莫瑞甘"  
RandomNicknames_Female[5]="神谕"  
RandomNicknames_Female[6]="女巫"  
RandomNicknames_Female[7]="紫罗兰"  
  
; 排名名称和图标
RankNames[0]="新兵"  
RankNames[1]="入门者"  
RankNames[2]="熟练者"  
RankNames[3]="信徒"  
RankNames[4]="秘者"  
RankNames[5]="信徒"  
RankNames[6]="炽天使"  
RankNames[7]="巫师"  
;RankNames[8]="虚空"  
  
ShortNames[0]="新兵"  
ShortNames[1]="入门"  
ShortNames[2]="熟练"  
ShortNames[3]="信徒"  
ShortNames[4]="秘者"  
ShortNames[5]="信徒"  
ShortNames[6]="炽天"  
ShortNames[7]="巫师"  
;ShortNames[8]="虚空"  
  
;重新排列以更好地匹配等级能力
RankIcons[0]= "UILibrary_Common.rank_rookie"  
RankIcons[1]= "UILibrary_Common.psirank_initiate"  
RankIcons[2]= "UILibrary_Common.psirank_adept"  
RankIcons[3]= "UILibrary_Common.psirank_acolyte"  
RankIcons[4]= "UILibrary_Common.psirank_mystic"  
RankIcons[5]= "UILibrary_Common.psirank_disciple"  
RankIcons[6]= "UILibrary_Common.psirank_warlock"  
RankIcons[7]= "UILibrary_Common.psirank_magus"  
;RankIcons[8]= "UILibrary_RustyPsionic.psirank_void"  
  
;照片上的名言  
PhotoboothSoloBLines_Male[0]="他最伟大的武器...是他的智慧！"  
PhotoboothSoloBLines_Female[0]="她最伟大的武器...是她的智慧！"
